<template>
  <div class="chart-content">
    <navBar :title="title"></navBar>
    <div class="chart-box" ref="mapChart" :style="{ 'background-color': themeType == 1 ? '#07124a' : '#fff' }"></div>
  </div>
</template>

<script>
import navBar from "components/nav/navBar";
//   import 'echarts/map/js/world.js'
import "echarts/map/js/china.js"; // 引入中国地图数据
export default {
  props: {
    title: {
      default: "散点气泡地图",
      type: String,
    },
    data: {
      type: Array,
    },
    color: {
      type: Array,
    },
  },
  data() {
    return {
      attr: {
        name: "个人用户",
        unitName: "用户数",
        unit: "人",
      },
      datas: [
        {
          name: "喀什地区",
          value: [75.9891, 39.4677, 115],
        },
        {
          name: "克孜勒苏柯尔克孜自治州",
          value: [76.1728, 39.7134, 17],
        },
        {
          name: "和田地区",
          value: [79.9253, 37.1107, 43],
        },
        {
          name: "阿里地区",
          value: [80.1055, 32.5032, 4],
        },
        {
          name: "阿克苏地区",
          value: [80.2651, 41.1707, 254],
        },
        {
          name: "伊犁哈萨克自治州",
          value: [81.297854, 43.922248, 77],
        },
        {
          name: "伊犁哈萨克自治州",
          value: [81.3179, 43.9219, 395],
        },
        {
          name: "克拉玛依市",
          value: [84.8739, 45.5959, 78],
        },
        {
          name: "巴音郭楞蒙古自治州",
          value: [86.151, 41.7686, 332],
        },
        {
          name: "昌吉回族自治州",
          value: [87.304, 44.0146, 700],
        },
        {
          name: "乌鲁木齐市",
          value: [87.6177, 43.7928, 797],
        },
        {
          name: "自治区直辖县级行政区划",
          value: [87.6177, 43.7928, 219],
        },
        {
          name: "阿勒泰地区",
          value: [88.137915, 47.839744, 7],
        },
        {
          name: "阿勒泰地区",
          value: [88.1396, 47.8484, 66],
        },
        {
          name: "日喀则市",
          value: [88.885147, 29.267519, 7],
        },
        {
          name: "日喀则地区",
          value: [88.891486, 29.269023, 2],
        },
        {
          name: "吐鲁番地区",
          value: [89.1841, 42.9476, 36],
        },
        {
          name: "新疆维吾尔自治区",
          value: [89.189537, 42.951227, 4],
        },
        {
          name: "昌都地区",
          value: [91.1322, 29.6604, 39],
        },
        {
          name: "那曲地区",
          value: [92.0602, 31.476, 5],
        },
        {
          name: "新疆维吾尔自治区",
          value: [93.51316, 42.833248, 1],
        },
        {
          name: "哈密地区",
          value: [93.5132, 42.8332, 91],
        },
        {
          name: "西藏自治区",
          value: [94.357825, 29.648103, 3],
        },
        {
          name: "林芝地区",
          value: [94.3624, 29.6547, 12],
        },
        {
          name: "玉树藏族自治州",
          value: [97.0085, 33.004, 786],
        },
        {
          name: "西藏自治区",
          value: [97.178452, 31.136875, 2],
        },
        {
          name: "海西蒙古族藏族自治州",
          value: [97.3708, 37.3747, 242],
        },
        {
          name: "怒江傈僳族自治州",
          value: [98.8543, 25.8509, 1121],
        },
        {
          name: "保山市",
          value: [99.1671, 25.1118, 1691],
        },
        {
          name: "迪庆藏族自治州",
          value: [99.7065, 27.8269, 111],
        },
        {
          name: "临沧市",
          value: [100.087, 23.8866, 601],
        },
        {
          name: "大理白族自治州",
          value: [100.226, 25.5894, 1392],
        },
        {
          name: "丽江市",
          value: [100.233, 26.8721, 355],
        },
        {
          name: "果洛藏族自治州",
          value: [100.242, 34.4736, 1012],
        },
        {
          name: "张掖市",
          value: [100.455, 38.9329, 1057],
        },
        {
          name: "海南藏族自治州",
          value: [100.62, 36.2804, 646],
        },
        {
          name: "西双版纳傣族自治州",
          value: [100.798, 22.0017, 291],
        },
        {
          name: "海北藏族自治州",
          value: [100.901, 36.9594, 164],
        },
        {
          name: "普洱市",
          value: [100.972, 22.7773, 774],
        },
        {
          name: "楚雄彝族自治州",
          value: [101.546, 25.042, 961],
        },
        {
          name: "攀枝花市",
          value: [101.716, 26.5804, 226],
        },
        {
          name: "西宁市",
          value: [101.779, 36.6232, 738],
        },
        {
          name: "甘孜藏族自治州",
          value: [101.964, 30.0507, 253],
        },
        {
          name: "黄南藏族自治州",
          value: [102.02, 35.5177, 110],
        },
        {
          name: "海东地区",
          value: [102.085207, 36.51761, 8],
        },
        {
          name: "海东市",
          value: [102.103, 36.5029, 235],
        },
        {
          name: "金昌市",
          value: [102.188, 38.5142, 173],
        },
        {
          name: "阿坝藏族羌族自治州",
          value: [102.221, 31.8998, 251],
        },
        {
          name: "凉山彝族自治州",
          value: [102.259, 27.8868, 1229],
        },
        {
          name: "甘南藏族自治州",
          value: [102.911, 34.9864, 62],
        },
        {
          name: "雅安市",
          value: [103.001, 29.9877, 848],
        },
        {
          name: "临夏回族自治州",
          value: [103.212, 35.5994, 355],
        },
        {
          name: "昭通市",
          value: [103.717, 27.337, 642],
        },
        {
          name: "乐山市",
          value: [103.761, 29.582, 2493],
        },
        {
          name: "曲靖市",
          value: [103.798, 25.5016, 2473],
        },
        {
          name: "兰州市",
          value: [103.824, 36.058, 1670],
        },
        {
          name: "眉山市",
          value: [103.832, 30.0483, 2304],
        },
        {
          name: "成都市",
          value: [104.066, 30.6595, 14060],
        },
        {
          name: "宜宾市",
          value: [104.631, 28.7602, 2089],
        },
        {
          name: "资阳市",
          value: [104.642, 30.1222, 1193],
        },
        {
          name: "绵阳市",
          value: [104.742, 31.464, 5256],
        },
        {
          name: "自贡市",
          value: [104.773, 29.3528, 795],
        },
        {
          name: "六盘水市",
          value: [104.847, 26.5846, 1101],
        },
        {
          name: "陇南市",
          value: [104.929, 33.3886, 449],
        },
        {
          name: "内江市",
          value: [105.066, 29.5871, 1041],
        },
        {
          name: "中卫市",
          value: [105.19, 37.5149, 688],
        },
        {
          name: "毕节市",
          value: [105.285, 27.3017, 4516],
        },
        {
          name: "毕节地区",
          value: [105.300492, 27.302612, 14],
        },
        {
          name: "泸州市",
          value: [105.443, 28.8891, 4035],
        },
        {
          name: "遂宁市",
          value: [105.571, 30.5133, 2032],
        },
        {
          name: "阿拉善盟",
          value: [105.706, 38.8448, 339],
        },
        {
          name: "天水市",
          value: [105.725, 34.5785, 1197],
        },
        {
          name: "广元市",
          value: [105.83, 32.4337, 971],
        },
        {
          name: "安顺市",
          value: [105.932, 26.2455, 744],
        },
        {
          name: "南充市",
          value: [106.083, 30.7953, 4563],
        },
        {
          name: "吴忠市",
          value: [106.199, 37.9862, 840],
        },
        {
          name: "银川市",
          value: [106.278, 38.4664, 1449],
        },
        {
          name: "固原市",
          value: [106.285, 36.0046, 391],
        },
        {
          name: "石嘴山市",
          value: [106.376, 39.0133, 1063],
        },
        {
          name: "重庆市",
          value: [106.505, 29.5332, 4682],
        },
        {
          name: "百色市",
          value: [106.616, 23.8977, 939],
        },
        {
          name: "广安市",
          value: [106.633, 30.4564, 1015],
        },
        {
          name: "平凉市",
          value: [106.685, 35.5428, 2234],
        },
        {
          name: "贵阳市",
          value: [106.713, 26.5783, 3733],
        },
        {
          name: "巴中市",
          value: [106.754, 31.8588, 743],
        },
        {
          name: "乌海市",
          value: [106.826, 39.6737, 111],
        },
        {
          name: "遵义市",
          value: [106.937, 27.7066, 2419],
        },
        {
          name: "汉中市",
          value: [107.029, 33.0777, 862],
        },
        {
          name: "汉中市",
          value: [107.045478, 33.081569, 74],
        },
        {
          name: "宝鸡市",
          value: [107.145, 34.3693, 1335],
        },
        {
          name: "崇左市",
          value: [107.354, 22.4041, 477],
        },
        {
          name: "巴彦淖尔市",
          value: [107.417, 40.7574, 1196],
        },
        {
          name: "达州市",
          value: [107.502, 31.2095, 2081],
        },
        {
          name: "庆阳市",
          value: [107.638, 35.7342, 1040],
        },
        {
          name: "河池市",
          value: [108.062, 24.6959, 844],
        },
        {
          name: "南宁市",
          value: [108.32, 22.824, 5389],
        },
        {
          name: "咸阳市",
          value: [108.705, 34.3334, 1770],
        },
        {
          name: "西安市",
          value: [108.948, 34.2632, 4928],
        },
        {
          name: "铜川市",
          value: [108.98, 34.9166, 229],
        },
        {
          name: "安康市",
          value: [109.029, 32.6903, 1132],
        },
        {
          name: "北海市",
          value: [109.119, 21.4733, 1232],
        },
        {
          name: "铜仁市",
          value: [109.192, 27.7183, 751],
        },
        {
          name: "铜仁地区",
          value: [109.196161, 27.726271, 10],
        },
        {
          name: "来宾市",
          value: [109.23, 23.7338, 804],
        },
        {
          name: "柳州市",
          value: [109.412, 24.3146, 1498],
        },
        {
          name: "延安市",
          value: [109.491, 36.5965, 541],
        },
        {
          name: "渭南市",
          value: [109.503, 34.4994, 2799],
        },
        {
          name: "三亚市",
          value: [109.508, 18.2479, 364],
        },
        {
          name: "海南省",
          value: [109.576782, 19.517486, 3],
        },
        {
          name: "贵港市",
          value: [109.602, 23.0936, 1461],
        },
        {
          name: "榆林市",
          value: [109.741, 38.2902, 1393],
        },
        {
          name: "包头市",
          value: [109.84, 40.6582, 924],
        },
        {
          name: "商洛市",
          value: [109.94, 33.8683, 474],
        },
        {
          name: "怀化市",
          value: [109.978, 27.5501, 1568],
        },
        {
          name: "怀化市",
          value: [109.986959, 27.557483, 68],
        },
        {
          name: "鄂尔多斯市",
          value: [109.99, 39.8172, 1118],
        },
        {
          name: "玉林市",
          value: [110.154, 22.6314, 3560],
        },
        {
          name: "桂林市",
          value: [110.299, 25.2742, 2893],
        },
        {
          name: "海口市",
          value: [110.331, 20.032, 1487],
        },
        {
          name: "海南省",
          value: [110.331, 20.032, 947],
        },
        {
          name: "湛江市",
          value: [110.365, 21.2749, 2710],
        },
        {
          name: "张家界市",
          value: [110.48, 29.1274, 253],
        },
        {
          name: "十堰市",
          value: [110.788, 32.6469, 622],
        },
        {
          name: "茂名市",
          value: [110.919, 21.6597, 2925],
        },
        {
          name: "运城市",
          value: [111.004, 35.0228, 3244],
        },
        {
          name: "吕梁市",
          value: [111.134, 37.5244, 1479],
        },
        {
          name: "三门峡市",
          value: [111.194, 34.7773, 669],
        },
        {
          name: "宜昌市",
          value: [111.291, 30.7026, 3403],
        },
        {
          name: "梧州市",
          value: [111.298, 23.4748, 1363],
        },
        {
          name: "邵阳市",
          value: [111.461525, 27.236811, 56],
        },
        {
          name: "邵阳市",
          value: [111.469, 27.2378, 1709],
        },
        {
          name: "临汾市",
          value: [111.518, 36.0841, 2268],
        },
        {
          name: "贺州市",
          value: [111.552, 24.4141, 911],
        },
        {
          name: "永州市",
          value: [111.608, 26.4345, 1384],
        },
        {
          name: "呼和浩特市",
          value: [111.671, 40.8183, 2656],
        },
        {
          name: "常德市",
          value: [111.691, 29.0402, 1843],
        },
        {
          name: "阳江市",
          value: [111.975, 21.8592, 1735],
        },
        {
          name: "娄底市",
          value: [112.008, 27.7281, 1715],
        },
        {
          name: "云浮市",
          value: [112.044, 22.9298, 1111],
        },
        {
          name: "襄阳市",
          value: [112.144, 32.0424, 1906],
        },
        {
          name: "襄樊市",
          value: [112.176326, 32.094934, 40],
        },
        {
          name: "荆门市",
          value: [112.204, 31.0354, 2106],
        },
        {
          name: "荆州市",
          value: [112.238, 30.3269, 2472],
        },
        {
          name: "三沙市",
          value: [112.349, 16.831, 15],
        },
        {
          name: "益阳市",
          value: [112.355, 28.5701, 2227],
        },
        {
          name: "益阳市",
          value: [112.366547, 28.588088, 205],
        },
        {
          name: "朔州市",
          value: [112.433, 39.3313, 747],
        },
        {
          name: "洛阳市",
          value: [112.434, 34.663, 2882],
        },
        {
          name: "肇庆市",
          value: [112.473, 23.0515, 1797],
        },
        {
          name: "南阳市",
          value: [112.541, 32.9991, 5782],
        },
        {
          name: "太原市",
          value: [112.549, 37.857, 3873],
        },
        {
          name: "衡阳市",
          value: [112.583819, 26.898164, 57],
        },
        {
          name: "衡阳市",
          value: [112.608, 26.9004, 1636],
        },
        {
          name: "忻州市",
          value: [112.734, 38.4177, 1128],
        },
        {
          name: "晋中市",
          value: [112.736, 37.6965, 2565],
        },
        {
          name: "晋城市",
          value: [112.851, 35.4976, 970],
        },
        {
          name: "湘潭市",
          value: [112.935556, 27.835095, 65],
        },
        {
          name: "湘潭市",
          value: [112.944, 27.8297, 971],
        },
        {
          name: "长沙市",
          value: [112.982, 28.1941, 7147],
        },
        {
          name: "郴州市",
          value: [113.032, 25.7936, 1839],
        },
        {
          name: "清远市",
          value: [113.051, 23.685, 1239],
        },
        {
          name: "江门市",
          value: [113.095, 22.5904, 2746],
        },
        {
          name: "长治市",
          value: [113.114, 36.1911, 4260],
        },
        {
          name: "乌兰察布市",
          value: [113.115, 41.0341, 991],
        },
        {
          name: "佛山市",
          value: [113.123, 23.0288, 3444],
        },
        {
          name: "岳阳市",
          value: [113.133, 29.3703, 2274],
        },
        {
          name: "株洲市",
          value: [113.152, 27.8358, 1386],
        },
        {
          name: "焦作市",
          value: [113.238, 35.239, 2071],
        },
        {
          name: "广州市",
          value: [113.281, 23.1252, 7572],
        },
        {
          name: "大同市",
          value: [113.295, 40.0903, 1341],
        },
        {
          name: "平顶山市",
          value: [113.308, 33.7352, 1630],
        },
        {
          name: "随州市",
          value: [113.374, 31.7175, 1416],
        },
        {
          name: "中山市",
          value: [113.382, 22.5211, 1167],
        },
        {
          name: "珠海市",
          value: [113.554, 22.225, 942],
        },
        {
          name: "阳泉市",
          value: [113.583, 37.8612, 1042],
        },
        {
          name: "韶关市",
          value: [113.592, 24.8013, 1926],
        },
        {
          name: "省直辖县级行政区划",
          value: [113.665, 34.758, 614],
        },
        {
          name: "郑州市",
          value: [113.665, 34.758, 8836],
        },
        {
          name: "东莞市",
          value: [113.746, 23.0462, 1898],
        },
        {
          name: "许昌市",
          value: [113.826, 34.023, 1132],
        },
        {
          name: "萍乡市",
          value: [113.852, 27.6229, 542],
        },
        {
          name: "新乡市",
          value: [113.884, 35.3026, 4374],
        },
        {
          name: "孝感市",
          value: [113.927, 30.9264, 1912],
        },
        {
          name: "驻马店市",
          value: [114.025, 32.9802, 4320],
        },
        {
          name: "漯河市",
          value: [114.026, 33.5759, 1691],
        },
        {
          name: "信阳市",
          value: [114.075, 32.1233, 2047],
        },
        {
          name: "深圳市",
          value: [114.086, 22.547, 5511],
        },
        {
          name: "鹤壁市",
          value: [114.295, 35.7482, 1214],
        },
        {
          name: "省直辖县级行政区划",
          value: [114.299, 30.5844, 939],
        },
        {
          name: "武汉市",
          value: [114.299, 30.5844, 5419],
        },
        {
          name: "咸宁市",
          value: [114.329, 29.8328, 979],
        },
        {
          name: "开封市",
          value: [114.341, 34.7971, 2012],
        },
        {
          name: "安阳市",
          value: [114.352, 36.1034, 2314],
        },
        {
          name: "宜春市",
          value: [114.391, 27.8043, 3676],
        },
        {
          name: "惠州市",
          value: [114.413, 23.0794, 1800],
        },
        {
          name: "邯郸市",
          value: [114.491, 36.6123, 3731],
        },
        {
          name: "石家庄市",
          value: [114.502, 38.0455, 8052],
        },
        {
          name: "邢台市",
          value: [114.509, 37.0682, 4577],
        },
        {
          name: "石家庄市",
          value: [114.522082, 38.048958, 692],
        },
        {
          name: "周口市",
          value: [114.65, 33.6204, 3499],
        },
        {
          name: "河源市",
          value: [114.698, 23.7463, 958],
        },
        {
          name: "黄冈市",
          value: [114.879, 30.4477, 2236],
        },
        {
          name: "张家口市",
          value: [114.884, 40.8119, 2374],
        },
        {
          name: "鄂州市",
          value: [114.891, 30.3965, 492],
        },
        {
          name: "新余市",
          value: [114.931, 27.8108, 725],
        },
        {
          name: "赣州市",
          value: [114.94, 25.851, 2891],
        },
        {
          name: "吉安市",
          value: [114.986, 27.1117, 3195],
        },
        {
          name: "濮阳市",
          value: [115.041, 35.7682, 1131],
        },
        {
          name: "黄石市",
          value: [115.077, 30.2201, 562],
        },
        {
          name: "汕尾市",
          value: [115.364, 22.7745, 900],
        },
        {
          name: "菏泽市",
          value: [115.469, 35.2465, 6098],
        },
        {
          name: "保定市",
          value: [115.482, 38.8677, 4425],
        },
        {
          name: "商丘市",
          value: [115.65, 34.4371, 3162],
        },
        {
          name: "衡水市",
          value: [115.666, 37.7351, 2449],
        },
        {
          name: "亳州市",
          value: [115.783, 33.8693, 2737],
        },
        {
          name: "阜阳市",
          value: [115.82, 32.897, 2299],
        },
        {
          name: "南昌市",
          value: [115.892, 28.6765, 3322],
        },
        {
          name: "聊城市",
          value: [115.98, 36.456, 3003],
        },
        {
          name: "九江市",
          value: [115.993, 29.712, 1002],
        },
        {
          name: "九江地区",
          value: [115.999848, 29.71964, 1],
        },
        {
          name: "九江市",
          value: [115.999848, 29.71964, 89],
        },
        {
          name: "锡林郭勒盟",
          value: [116.091, 43.944, 374],
        },
        {
          name: "梅州市",
          value: [116.118, 24.2991, 1345],
        },
        {
          name: "德州市",
          value: [116.307, 37.454, 2811],
        },
        {
          name: "揭阳市",
          value: [116.356, 23.5438, 907],
        },
        {
          name: "抚州市",
          value: [116.358, 27.9839, 1530],
        },
        {
          name: "北京市",
          value: [116.405, 39.905, 10621],
        },
        {
          name: "六安市",
          value: [116.508, 31.7529, 1684],
        },
        {
          name: "济宁市",
          value: [116.587, 35.4154, 4259],
        },
        {
          name: "潮州市",
          value: [116.632, 23.6617, 501],
        },
        {
          name: "廊坊市",
          value: [116.704, 39.5239, 2225],
        },
        {
          name: "汕头市",
          value: [116.708, 23.371, 791],
        },
        {
          name: "淮北市",
          value: [116.795, 33.9717, 943],
        },
        {
          name: "沧州市",
          value: [116.857, 38.3106, 3868],
        },
        {
          name: "宿州市",
          value: [116.984, 33.6339, 2585],
        },
        {
          name: "济南市",
          value: [117.001, 36.6758, 5239],
        },
        {
          name: "淮南市",
          value: [117.018, 32.6476, 637],
        },
        {
          name: "龙岩市",
          value: [117.03, 25.0916, 3203],
        },
        {
          name: "鹰潭市",
          value: [117.034, 28.2386, 461],
        },
        {
          name: "安庆市",
          value: [117.044, 30.5088, 788],
        },
        {
          name: "泰安市",
          value: [117.129, 36.195, 2610],
        },
        {
          name: "徐州市",
          value: [117.185, 34.2618, 3850],
        },
        {
          name: "天津市",
          value: [117.19, 39.1256, 3451],
        },
        {
          name: "景德镇市",
          value: [117.215, 29.2926, 293],
        },
        {
          name: "合肥市",
          value: [117.283, 31.8612, 4757],
        },
        {
          name: "蚌埠市",
          value: [117.363, 32.9397, 1855],
        },
        {
          name: "池州市",
          value: [117.489, 30.656, 303],
        },
        {
          name: "枣庄市",
          value: [117.558, 34.8564, 1175],
        },
        {
          name: "三明市",
          value: [117.635, 26.2654, 1492],
        },
        {
          name: "漳州市",
          value: [117.662, 24.5109, 5216],
        },
        {
          name: "莱芜市",
          value: [117.678, 36.2144, 486],
        },
        {
          name: "铜陵市",
          value: [117.817, 30.9299, 150],
        },
        {
          name: "巢湖市",
          value: [117.88049, 31.608733, 17],
        },
        {
          name: "承德市",
          value: [117.939, 40.9762, 1602],
        },
        {
          name: "上饶市",
          value: [117.971, 28.4444, 1727],
        },
        {
          name: "滨州市",
          value: [118.017, 37.3835, 3523],
        },
        {
          name: "淄博市",
          value: [118.048, 36.8149, 2001],
        },
        {
          name: "厦门市",
          value: [118.11, 24.4905, 3397],
        },
        {
          name: "唐山市",
          value: [118.175, 39.6351, 11193],
        },
        {
          name: "南平市",
          value: [118.178, 26.6356, 1982],
        },
        {
          name: "宿迁市",
          value: [118.275, 33.963, 2915],
        },
        {
          name: "滁州市",
          value: [118.316, 32.3036, 1547],
        },
        {
          name: "黄山市",
          value: [118.317, 29.7092, 456],
        },
        {
          name: "临沂市",
          value: [118.326, 35.0653, 13681],
        },
        {
          name: "芜湖市",
          value: [118.376, 31.3263, 717],
        },
        {
          name: "马鞍山市",
          value: [118.508, 31.6894, 387],
        },
        {
          name: "泉州市",
          value: [118.589, 24.9089, 1977],
        },
        {
          name: "东营市",
          value: [118.665, 37.4346, 1167],
        },
        {
          name: "宣城市",
          value: [118.758, 30.9457, 508],
        },
        {
          name: "南京市",
          value: [118.767, 32.0415, 3973],
        },
        {
          name: "衢州市",
          value: [118.873, 28.9417, 1412],
        },
        {
          name: "赤峰市",
          value: [118.957, 42.2753, 2355],
        },
        {
          name: "莆田市",
          value: [119.008, 25.431, 1533],
        },
        {
          name: "淮安市",
          value: [119.021, 33.5975, 2787],
        },
        {
          name: "潍坊市",
          value: [119.107, 36.7093, 8070],
        },
        {
          name: "连云港市",
          value: [119.179, 34.6, 2647],
        },
        {
          name: "福州市",
          value: [119.306, 26.0753, 3484],
        },
        {
          name: "扬州市",
          value: [119.421, 32.3932, 1074],
        },
        {
          name: "镇江市",
          value: [119.453, 32.2044, 537],
        },
        {
          name: "日照市",
          value: [119.461, 35.4286, 1818],
        },
        {
          name: "宁德市",
          value: [119.527, 26.6592, 1242],
        },
        {
          name: "秦皇岛市",
          value: [119.587, 39.9425, 1423],
        },
        {
          name: "金华市",
          value: [119.65, 29.0895, 3186],
        },
        {
          name: "呼伦贝尔市",
          value: [119.758, 49.2153, 726],
        },
        {
          name: "泰州市",
          value: [119.915, 32.4849, 2061],
        },
        {
          name: "丽水市",
          value: [119.922, 28.452, 422],
        },
        {
          name: "常州市",
          value: [119.947, 31.7728, 988],
        },
        {
          name: "湖州市",
          value: [120.102, 30.8672, 1712],
        },
        {
          name: "盐城市",
          value: [120.14, 33.3776, 4452],
        },
        {
          name: "杭州市",
          value: [120.154, 30.2875, 4177],
        },
        {
          name: "无锡市",
          value: [120.302, 31.5747, 1478],
        },
        {
          name: "青岛市",
          value: [120.355, 36.083, 7274],
        },
        {
          name: "朝阳市",
          value: [120.451, 41.5768, 1456],
        },
        {
          name: "绍兴市",
          value: [120.582, 29.9971, 869],
        },
        {
          name: "苏州市",
          value: [120.62, 31.2994, 3747],
        },
        {
          name: "温州市",
          value: [120.672, 28.0006, 1405],
        },
        {
          name: "嘉兴市",
          value: [120.751, 30.7627, 1190],
        },
        {
          name: "葫芦岛市",
          value: [120.856, 40.7556, 2154],
        },
        {
          name: "南通市",
          value: [120.865, 32.0162, 3147],
        },
        {
          name: "锦州市",
          value: [121.136, 41.1193, 4217],
        },
        {
          name: "烟台市",
          value: [121.391, 37.5393, 5175],
        },
        {
          name: "台州市",
          value: [121.429, 28.6614, 4128],
        },
        {
          name: "上海市",
          value: [121.473, 31.2317, 1250],
        },
        {
          name: "宁波市",
          value: [121.55, 29.8684, 2153],
        },
        {
          name: "大连市",
          value: [121.619, 38.9146, 2978],
        },
        {
          name: "阜新市",
          value: [121.649, 42.0118, 1808],
        },
        {
          name: "盘锦市",
          value: [122.07, 41.1245, 974],
        },
        {
          name: "兴安盟",
          value: [122.07, 46.0763, 987],
        },
        {
          name: "舟山市",
          value: [122.107, 30.016, 136],
        },
        {
          name: "威海市",
          value: [122.116, 37.5097, 1216],
        },
        {
          name: "营口市",
          value: [122.235, 40.6674, 1256],
        },
        {
          name: "通辽市",
          value: [122.263, 43.6174, 2679],
        },
        {
          name: "白城市",
          value: [122.841, 45.619, 617],
        },
        {
          name: "鞍山市",
          value: [122.996, 41.1106, 2454],
        },
        {
          name: "辽阳市",
          value: [123.182, 41.2694, 1004],
        },
        {
          name: "沈阳市",
          value: [123.429, 41.7968, 8643],
        },
        {
          name: "本溪市",
          value: [123.771, 41.2979, 1363],
        },
        {
          name: "铁岭市",
          value: [123.844, 42.2906, 3482],
        },
        {
          name: "抚顺市",
          value: [123.921, 41.876, 813],
        },
        {
          name: "齐齐哈尔市",
          value: [123.958, 47.3421, 3648],
        },
        {
          name: "四平市",
          value: [124.371, 43.1703, 3610],
        },
        {
          name: "丹东市",
          value: [124.383, 40.1243, 1280],
        },
        {
          name: "大兴安岭地区",
          value: [124.712, 52.3353, 257],
        },
        {
          name: "松原市",
          value: [124.824, 45.1182, 3098],
        },
        {
          name: "大庆市",
          value: [125.113, 46.5907, 3038],
        },
        {
          name: "辽源市",
          value: [125.145, 42.9027, 583],
        },
        {
          name: "长春市",
          value: [125.325, 43.8868, 9277],
        },
        {
          name: "通化市",
          value: [125.937, 41.7212, 2912],
        },
        {
          name: "白山市",
          value: [126.428, 41.9425, 477],
        },
        {
          name: "吉林市",
          value: [126.553, 43.8436, 2810],
        },
        {
          name: "哈尔滨市",
          value: [126.642, 45.757, 11836],
        },
        {
          name: "绥化市",
          value: [126.993, 46.6374, 4966],
        },
        {
          name: "黑河市",
          value: [127.499, 50.2496, 3822],
        },
        {
          name: "伊春市",
          value: [128.899, 47.7248, 699],
        },
        {
          name: "延边朝鲜族自治州",
          value: [129.513, 42.9048, 652],
        },
        {
          name: "牡丹江市",
          value: [129.619, 44.583, 2363],
        },
        {
          name: "鹤岗市",
          value: [130.277, 47.3321, 500],
        },
        {
          name: "佳木斯市",
          value: [130.362, 46.8096, 2797],
        },
        {
          name: "鸡西市",
          value: [130.976, 45.3, 531],
        },
        {
          name: "七台河市",
          value: [131.016, 45.7713, 839],
        },
        {
          name: "双鸭山市",
          value: [131.157, 46.6434, 1867],
        },
      ],
    };
  },
  computed: {
    themeType() {
      return this.$store.getters.getThemeTyle;
    },
  },
  mounted() {
    this.initChart();
  },
  methods: {
    initChart() {
      let that = this,
        mapChart = that.$echarts.init(that.$refs.mapChart),
        option = {
          tooltip: {
            triggerOn: "onmousemove",
          },
          geo: {
            map: "china",
            height: "96%",
            label: {
              show: false,
            },
            itemStyle: {
              normal: {
                areaColor: "rgba(23,30,59,0.8)",
                borderWidth: 0.8, //设置外层边框
                borderColor: "#223055",
              },
              emphasis: {
                areaColor: "rgba(23,30,59,0.8)",
                borderWidth: 0.8, //设置外层边框
                borderColor: "#223055",
              },
            },
            emphasis: {
              label: {
                show: false,
              },
            },
          },
          legend: {
            show: false,
            orient: "vertical",
            top: "70%",
            left: "20%",
            data: [that.attr.name],
            textStyle: {
              color: "#fff",
            },
          },
          visualMap: {
            type: "piecewise",
            left: "25%",
            top: "75%",
            min: 0,
            max: 3000, //根据后台最大数值确定
            splitNumber: 5,
            color: ["#cc2996", "#8a2ee5", "#2600e5", "#0015ff", "#33bbff"], //设置坐标点从小到大的颜色
            pieces: [
              {
                lte: 1000,
                label: "用户数<=1000",
              },
              {
                gt: 1000,
                lte: 2000,
                label: "1000<用户数<=2000",
              },
              {
                gt: 2000,
                lte: 3000,
                label: "2000<用户数<=3000",
              },
              {
                gt: 3000,
                lte: 5000,
                label: "3000<用户数<=5000",
              },
              {
                gt: 5000,

                label: "5000<用户数",
              },
            ],
            textStyle: {
              color: "#aaaaaa",
            },
            itemWidth: 10,
            itemHeight: 10,
          },
          series: [
            {
              name: "outsideborder",
              map: "china",
              type: "map",
              height: "96%",
              roam: true,
              show: true,
              center: [104.29, 35.8], //设置可见中心坐标，以此坐标来放大和缩小
              tooltip: {
                show: false,
              },
              label: {
                show: false,
              },
              roam: false,
              itemStyle: {
                normal: {
                  areaColor: "rgba(20,30,64,0)",

                  borderWidth: 1.6, //设置外层边框
                  borderColor: "rgba(28,199,242,0.9)",
                  shadowBlur: 5,
                  shadowColor: "#4682B4",
                  shadowOffsetY: 6,
                },
                emphasis: {
                  areaColor: "rgba(20,30,64,0)",

                  borderWidth: 1.6, //设置外层边框
                  borderColor: "rgba(28,199,242,0.9)",
                  shadowBlur: 5,
                  shadowColor: "#4682B4",
                  shadowOffsetY: 6,
                },
              },
              emphasis: {
                label: {
                  show: false,
                },
              },
            },
            {
              //系列名称
              name: that.attr.name,
              tooltip: {
                formatter: function (param) {
                  return (
                    param.data.name +
                    "<br>" +
                    that.attr.unitName +
                    ":" +
                    param.data.value[2] +
                    that.attr.unit
                  );
                },
              },
              type: "scatter",
              coordinateSystem: "geo",
              symbolSize: function (val) {
                return 13;
              },
              hoverAnimation: true,
              itemStyle: {
                //坐标点的图形样式设置
                normal: {
                  color: "#ddb926",
                  shadowBlur: 10,
                  shadowColor: "#333",
                },
              },
              zlevel: 1,
              data: that.datas,
            },
            {
              name: "用户热力",
              type: "heatmap",
              coordinateSystem: "geo",
              data: that.datas,
            },
          ],
        };
      window.addEventListener("resize", function () {
        mapChart.resize();
      });
      mapChart.setOption(option, true);
    },
  },
  components: { navBar },
};
</script>

<style lang="scss" scoped>
</style>
